validation_case/analytical_heat_simple/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../0/include/initialConditions"

momentumSource
{
    type            patchMeanVelocityForce;
    active          yes;

    patchMeanVelocityForceCoeffs
    {
        selectionMode   all;
        patch           inlet;
        fields          (U);
        Ubar            $flowUbar;
        relaxation      0.8;
    }
}

// energySource
// {
//     type            scalarCodedSource;

//     selectionMode   all;

//     fields          (T);
//     name            sourceTime;

//     codeInclude
//     #{
//     #};

//     codeCorrect
//     #{
//         Pout<< "**codeCorrect**" << endl;
//     #};

//     codeAddSup
//     #{
//         const Time& time = mesh().time();
//         const scalarField& V = mesh_.V();
//         const vectorField& C = mesh_.C();
//         scalarField& TSource = eqn.source();

//         forAll(C, i)
//         {
//             TSource[i] -= 10*sin(6.28*C[i].x())*V[i];
//         }
//         Pout << "***codeAddSup***" << endl;
//     #};

//     codeConstrain
//     #{
//         Pout<< "**codeConstrain**" << endl;
//     #};
// }

// ************************************************************************* //
