validation_case/analytical_heat_simple/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

#include "include/initialConditions"

internalField   $bulkTemp;

boundaryField
{
    "wall.*"
    {
        // type            externalWallHeatFluxTemperature;

        // mode            coefficient;

        // Ta              uniform 323.25;
        // h               uniform 0.026;
        // thicknessLayers (0.75e-3);
        // kappaLayers     (1);

        // kappaMethod     fluidThermo;

        // value           uniform 323.25;
        type               fixedValue;
        value              $wallTemp;
    }

    // "(ymax|ymin)"
    // {
    //     // type            externalWallHeatFluxTemperature;

    //     // mode            coefficient;

    //     // Ta              uniform 300;
    //     // h               uniform 0.026;
    //     // thicknessLayers (2e-3);
    //     // kappaLayers     (1);

    //     // kappaMethod     fluidThermo;

    //     // value           uniform 300;
    //     type                fixedValue;
    //     value               uniform 293.15;
    // }

    // "(xmax|xmin)"
    // {
    //     // type            externalWallHeatFluxTemperature;

    //     // mode            coefficient;

    //     // Ta              uniform 300;
    //     // h               uniform 0.026;
    //     // thicknessLayers (2e-3);
    //     // kappaLayers     (1);

    //     // kappaMethod     fluidThermo;

    //     // value           uniform 300;
    //     type                fixedValue;
    //     value               uniform 293.15;
    // }

    #include "include/constantPatches"
}

// ************************************************************************* //
